/******************************************************************************/
Ext.ns('sav');
/******************************************************************************/
/* Форма ввода сообщения (внизу)                                              */
/******************************************************************************/
sav.messageForm = Ext.extend(Ext.form.FormPanel, {
//----------------------------------------------------------------------------//
	layout:'fit',
    title: '回复',
    defaultType: 'textfield',
    defaults: { anchor: '100%' },
	buttonAlign: 'center',
//----------------------------------------------------------------------------//
	// Поле ввода сообщения
	buildForm : function() {
		return [new Ext.form.TextArea({
			id:'tfAddMessage', 
			name: 'msg_text', 
			allowBlank: false
		})];
	},
//----------------------------------------------------------------------------//	
	// Кнопки
    buildUI: function(){
        return [{
			id: 'btnAddMessage',
            text: '提交',
            scope: this
        }];
    },
//----------------------------------------------------------------------------//		
	// Конструктор
    initComponent : function() {
        this.items = this.buildForm();
        this.buttons = this.buildUI();
        sav.messageForm.superclass.initComponent.call(this);
    }	
//----------------------------------------------------------------------------//		
});
/******************************************************************************/